www/ci4/app/Models/AllegatiModel.php

    public function inserisciAllegato($idSegnalazione, $filePercorso) {
        $db = db_connect(); // Connessione al database
        $datiAllegato = array(
            'SegnalazioneId' => $idSegnalazione,
            'PercorsoFile' => $filePercorso
        );
        // Inserisce i dati dell'allegato nella tabella
        if (!$this->db->table("allegati")->insert($datiAllegato)) {
---
INSERT INTO `allegati` (`SegnalazioneId`, `PercorsoFile`) VALUES (3, 'uploads/1717756780_04c2ee45da1deb148d4d.png')

    public function getAllegatiBySegnalazioneId($idSegnalazione) {
        $query = $this->db->table("allegati")
            ->select('PercorsoFile')
            ->where('SegnalazioneId', $idSegnalazione)
            ->get();
---
SELECT `PercorsoFile`
FROM `allegati`
WHERE `SegnalazioneId` = '3'