www/ci4/app/Models/SegnalazioniModel.php

    public function getSegnalazioneById($segnalazioneId)
    {
        // Query per ottenere i dati della segnalazione basati sull'ID
        $query = $this->db->table('segnalazioni')
                          ->select('segnalazioneId, TipoProblema, Titolo, Descrizione, DataCreazione, Stato, CoordinataLat, CoordinataLon')
                          ->where('segnalazioneId', $segnalazioneId)
                          ->get();
---
SELECT `segnalazioneId`, `TipoProblema`, `Titolo`, `Descrizione`, `DataCreazione`, `Stato`, `CoordinataLat`, `CoordinataLon`
FROM `segnalazioni`
WHERE `segnalazioneId` = '3'